Librerias/GDS_NM_WebServicesSabre/Web References/OTA_AirBookLLS200/OTA_AirBookLLS2.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:sws="https://webservices.sabre.com/websvc" xmlns:sws_xsd="http://webservices.sabre.com/sabreXML/2011/10" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="https://webservices.sabre.com/websvc" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types>
    <xsd:schema>
      <xsd:import schemaLocation="OTA_AirBookLLS2.0.0RQRS.xsd" namespace="http://webservices.sabre.com/sabreXML/2011/10" />
      <xsd:import schemaLocation="msg-header-2_0.xsd" namespace="http://www.ebxml.org/namespaces/messageHeader" />
      <xsd:import schemaLocation="wsse.xsd" namespace="http://schemas.xmlsoap.org/ws/2002/12/secext" />
      <xsd:import schemaLocation="STL_For_SabreProtocol_v.1.2.0.xsd" namespace="http://services.sabre.com/STL/v01" />
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="OTA_AirBookInput">
    <wsdl:part name="header" element="eb:MessageHeader" />
    <wsdl:part name="header2" element="wsse:Security" />
    <wsdl:part name="body" element="sws_xsd:OTA_AirBookRQ" />
  </wsdl:message>
  <wsdl:message name="OTA_AirBookOutput">
    <wsdl:part name="header" element="eb:MessageHeader" />
    <wsdl:part name="header2" element="wsse:Security" />
    <wsdl:part name="body" element="sws_xsd:OTA_AirBookRS" />
  </wsdl:message>
  <wsdl:portType name="OTA_AirBookPortType">
    <wsdl:operation name="OTA_AirBookRQ">
      <wsdl:input message="sws:OTA_AirBookInput" />
      <wsdl:output message="sws:OTA_AirBookOutput" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="OTA_AirBookSoapBinding" type="sws:OTA_AirBookPortType">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="OTA_AirBookRQ">
      <soap:operation soapAction="OTA_AirBookLLSRQ" />
      <wsdl:input>
        <soap:header message="sws:OTA_AirBookInput" part="header" use="literal" />
        <soap:header message="sws:OTA_AirBookInput" part="header2" use="literal" />
        <soap:body use="literal" parts="body" />
      </wsdl:input>
      <wsdl:output>
        <soap:header message="sws:OTA_AirBookOutput" part="header" use="literal" />
        <soap:header message="sws:OTA_AirBookOutput" part="header2" use="literal" />
        <soap:body use="literal" parts="body" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="OTA_AirBookService">
    <wsdl:port name="OTA_AirBookPortType" binding="sws:OTA_AirBookSoapBinding">
      <soap:address location="https://webservices.sabre.com/websvc" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>